GopalSaraf/Practicals/PSDL/include/proc/pic16lf1559.inc
// Register: AD2GRD
#define AD2GRD AD2GRD
AD2GRD                                   equ 0798h
// bitfield definitions
AD2GRD_GRD2POL_POSN                      equ 0005h
AD2GRD_GRD2POL_POSITION                  equ 0005h
AD2GRD_GRD2POL_SIZE                      equ 0001h
AD2GRD_GRD2POL_LENGTH                    equ 0001h
AD2GRD_GRD2POL_MASK                      equ 0020h
AD2GRD_GRD2AOE_POSN                      equ 0006h
AD2GRD_GRD2AOE_POSITION                  equ 0006h
AD2GRD_GRD2AOE_SIZE                      equ 0001h
AD2GRD_GRD2AOE_LENGTH                    equ 0001h
AD2GRD_GRD2AOE_MASK                      equ 0040h
AD2GRD_GRD2BOE_POSN                      equ 0007h
AD2GRD_GRD2BOE_POSITION                  equ 0007h
AD2GRD_GRD2BOE_SIZE                      equ 0001h
AD2GRD_GRD2BOE_LENGTH                    equ 0001h
AD2GRD_GRD2BOE_MASK                      equ 0080h
AD2GRD_GRDPOL_POSN                       equ 0005h
AD2GRD_GRDPOL_POSITION                   equ 0005h
AD2GRD_GRDPOL_SIZE                       equ 0001h
AD2GRD_GRDPOL_LENGTH                     equ 0001h
AD2GRD_GRDPOL_MASK                       equ 0020h
AD2GRD_GRDAOE_POSN                       equ 0006h
AD2GRD_GRDAOE_POSITION                   equ 0006h
AD2GRD_GRDAOE_SIZE                       equ 0001h
AD2GRD_GRDAOE_LENGTH                     equ 0001h
AD2GRD_GRDAOE_MASK                       equ 0040h
AD2GRD_GRDBOE_POSN                       equ 0007h
AD2GRD_GRDBOE_POSITION                   equ 0007h
AD2GRD_GRDBOE_SIZE                       equ 0001h
AD2GRD_GRDBOE_LENGTH                     equ 0001h
AD2GRD_GRDBOE_MASK                       equ 0080h

// Register: AD2CAPCON
#define AD2CAPCON AD2CAPCON
AD2CAPCON                                equ 0799h
// bitfield definitions
AD2CAPCON_ADDCAP_POSN                    equ 0000h
AD2CAPCON_ADDCAP_POSITION                equ 0000h
AD2CAPCON_ADDCAP_SIZE                    equ 0004h
AD2CAPCON_ADDCAP_LENGTH                  equ 0004h
AD2CAPCON_ADDCAP_MASK                    equ 000Fh
AD2CAPCON_ADCAP_POSN                     equ 0000h
AD2CAPCON_ADCAP_POSITION                 equ 0000h
AD2CAPCON_ADCAP_SIZE                     equ 0004h
AD2CAPCON_ADCAP_LENGTH                   equ 0004h
AD2CAPCON_ADCAP_MASK                     equ 000Fh
AD2CAPCON_ADDCAP0_POSN                   equ 0000h
AD2CAPCON_ADDCAP0_POSITION               equ 0000h
AD2CAPCON_ADDCAP0_SIZE                   equ 0001h
AD2CAPCON_ADDCAP0_LENGTH                 equ 0001h
AD2CAPCON_ADDCAP0_MASK                   equ 0001h
AD2CAPCON_ADDCAP1_POSN                   equ 0001h
AD2CAPCON_ADDCAP1_POSITION               equ 0001h
AD2CAPCON_ADDCAP1_SIZE                   equ 0001h
AD2CAPCON_ADDCAP1_LENGTH                 equ 0001h
AD2CAPCON_ADDCAP1_MASK                   equ 0002h
AD2CAPCON_ADDCAP2_POSN                   equ 0002h
AD2CAPCON_ADDCAP2_POSITION               equ 0002h
AD2CAPCON_ADDCAP2_SIZE                   equ 0001h
AD2CAPCON_ADDCAP2_LENGTH                 equ 0001h
AD2CAPCON_ADDCAP2_MASK                   equ 0004h
AD2CAPCON_ADDCAP3_POSN                   equ 0003h
AD2CAPCON_ADDCAP3_POSITION               equ 0003h
AD2CAPCON_ADDCAP3_SIZE                   equ 0001h
AD2CAPCON_ADDCAP3_LENGTH                 equ 0001h
AD2CAPCON_ADDCAP3_MASK                   equ 0008h
AD2CAPCON_ADD2CAP_POSN                   equ 0000h
AD2CAPCON_ADD2CAP_POSITION               equ 0000h
AD2CAPCON_ADD2CAP_SIZE                   equ 0004h
AD2CAPCON_ADD2CAP_LENGTH                 equ 0004h
AD2CAPCON_ADD2CAP_MASK                   equ 000Fh

// Register: AAD2RES0L
#define AAD2RES0L AAD2RES0L
AAD2RES0L                                equ 079Ah
// bitfield definitions
AAD2RES0L_ADRESL_POSN                    equ 0000h
AAD2RES0L_ADRESL_POSITION                equ 0000h
AAD2RES0L_ADRESL_SIZE                    equ 0008h
AAD2RES0L_ADRESL_LENGTH                  equ 0008h
AAD2RES0L_ADRESL_MASK                    equ 00FFh

// Register: AAD2RES0H
#define AAD2RES0H AAD2RES0H
AAD2RES0H                                equ 079Bh
// bitfield definitions
AAD2RES0H_ADRESH_POSN                    equ 0000h
AAD2RES0H_ADRESH_POSITION                equ 0000h
AAD2RES0H_ADRESH_SIZE                    equ 0008h
AAD2RES0H_ADRESH_LENGTH                  equ 0008h
AAD2RES0H_ADRESH_MASK                    equ 00FFh

// Register: AAD2RES1L
#define AAD2RES1L AAD2RES1L
AAD2RES1L                                equ 079Ch
// bitfield definitions
AAD2RES1L_ADRESL_POSN                    equ 0000h
AAD2RES1L_ADRESL_POSITION                equ 0000h
AAD2RES1L_ADRESL_SIZE                    equ 0008h
AAD2RES1L_ADRESL_LENGTH                  equ 0008h
AAD2RES1L_ADRESL_MASK                    equ 00FFh

// Register: AAD2RES1H
#define AAD2RES1H AAD2RES1H
AAD2RES1H                                equ 079Dh
// bitfield definitions
AAD2RES1H_ADRESH_POSN                    equ 0000h
AAD2RES1H_ADRESH_POSITION                equ 0000h
AAD2RES1H_ADRESH_SIZE                    equ 0008h
AAD2RES1H_ADRESH_LENGTH                  equ 0008h
AAD2RES1H_ADRESH_MASK                    equ 00FFh

// Register: AD2CH
#define AD2CH AD2CH
AD2CH                                    equ 079Eh
// bitfield definitions
AD2CH_CH20_POSN                          equ 0000h
AD2CH_CH20_POSITION                      equ 0000h
AD2CH_CH20_SIZE                          equ 0001h
AD2CH_CH20_LENGTH                        equ 0001h
AD2CH_CH20_MASK                          equ 0001h
AD2CH_CH21_POSN                          equ 0001h
AD2CH_CH21_POSITION                      equ 0001h
AD2CH_CH21_SIZE                          equ 0001h
AD2CH_CH21_LENGTH                        equ 0001h
AD2CH_CH21_MASK                          equ 0002h
AD2CH_CH22_POSN                          equ 0002h
AD2CH_CH22_POSITION                      equ 0002h
AD2CH_CH22_SIZE                          equ 0001h
AD2CH_CH22_LENGTH                        equ 0001h
AD2CH_CH22_MASK                          equ 0004h
AD2CH_CH23_POSN                          equ 0003h
AD2CH_CH23_POSITION                      equ 0003h
AD2CH_CH23_SIZE                          equ 0001h
AD2CH_CH23_LENGTH                        equ 0001h
AD2CH_CH23_MASK                          equ 0008h
AD2CH_CH24_POSN                          equ 0004h
AD2CH_CH24_POSITION                      equ 0004h
AD2CH_CH24_SIZE                          equ 0001h
AD2CH_CH24_LENGTH                        equ 0001h
AD2CH_CH24_MASK                          equ 0010h
AD2CH_CH25_POSN                          equ 0005h
AD2CH_CH25_POSITION                      equ 0005h
AD2CH_CH25_SIZE                          equ 0001h
AD2CH_CH25_LENGTH                        equ 0001h
AD2CH_CH25_MASK                          equ 0020h
AD2CH_CH26_POSN                          equ 0006h
AD2CH_CH26_POSITION                      equ 0006h
AD2CH_CH26_SIZE                          equ 0001h
AD2CH_CH26_LENGTH                        equ 0001h
AD2CH_CH26_MASK                          equ 0040h

// Register: ICDIO
#define ICDIO ICDIO
ICDIO                                    equ 0F8Ch
// bitfield definitions
ICDIO_TRIS_ICDCLK_POSN                   equ 0002h
ICDIO_TRIS_ICDCLK_POSITION               equ 0002h
ICDIO_TRIS_ICDCLK_SIZE                   equ 0001h
ICDIO_TRIS_ICDCLK_LENGTH                 equ 0001h
ICDIO_TRIS_ICDCLK_MASK                   equ 0004h
ICDIO_TRIS_ICDDAT_POSN                   equ 0003h
ICDIO_TRIS_ICDDAT_POSITION               equ 0003h
ICDIO_TRIS_ICDDAT_SIZE                   equ 0001h
ICDIO_TRIS_ICDDAT_LENGTH                 equ 0001h
ICDIO_TRIS_ICDDAT_MASK                   equ 0008h
ICDIO_LAT_ICDCLK_POSN                    equ 0004h
ICDIO_LAT_ICDCLK_POSITION                equ 0004h
ICDIO_LAT_ICDCLK_SIZE                    equ 0001h
ICDIO_LAT_ICDCLK_LENGTH                  equ 0001h
ICDIO_LAT_ICDCLK_MASK                    equ 0010h
ICDIO_LAT_ICDDAT_POSN                    equ 0005h
ICDIO_LAT_ICDDAT_POSITION                equ 0005h
ICDIO_LAT_ICDDAT_SIZE                    equ 0001h
ICDIO_LAT_ICDDAT_LENGTH                  equ 0001h
ICDIO_LAT_ICDDAT_MASK                    equ 0020h
ICDIO_PORT_ICDCLK_POSN                   equ 0006h
ICDIO_PORT_ICDCLK_POSITION               equ 0006h
ICDIO_PORT_ICDCLK_SIZE                   equ 0001h
ICDIO_PORT_ICDCLK_LENGTH                 equ 0001h
ICDIO_PORT_ICDCLK_MASK                   equ 0040h
ICDIO_PORT_ICDDAT_POSN                   equ 0007h
ICDIO_PORT_ICDDAT_POSITION               equ 0007h
ICDIO_PORT_ICDDAT_SIZE                   equ 0001h
ICDIO_PORT_ICDDAT_LENGTH                 equ 0001h
ICDIO_PORT_ICDDAT_MASK                   equ 0080h

// Register: ICDCON0
#define ICDCON0 ICDCON0
ICDCON0                                  equ 0F8Dh
// bitfield definitions
ICDCON0_RSTVEC_POSN                      equ 0000h
ICDCON0_RSTVEC_POSITION                  equ 0000h
ICDCON0_RSTVEC_SIZE                      equ 0001h
ICDCON0_RSTVEC_LENGTH                    equ 0001h
ICDCON0_RSTVEC_MASK                      equ 0001h
ICDCON0_DBGINEX_POSN                     equ 0003h
ICDCON0_DBGINEX_POSITION                 equ 0003h
ICDCON0_DBGINEX_SIZE                     equ 0001h
ICDCON0_DBGINEX_LENGTH                   equ 0001h
ICDCON0_DBGINEX_MASK                     equ 0008h
ICDCON0_SSTEP_POSN                       equ 0005h
ICDCON0_SSTEP_POSITION                   equ 0005h
ICDCON0_SSTEP_SIZE                       equ 0001h
ICDCON0_SSTEP_LENGTH                     equ 0001h
ICDCON0_SSTEP_MASK                       equ 0020h
ICDCON0_FREEZ_POSN                       equ 0006h
ICDCON0_FREEZ_POSITION                   equ 0006h
ICDCON0_FREEZ_SIZE                       equ 0001h
ICDCON0_FREEZ_LENGTH                     equ 0001h
ICDCON0_FREEZ_MASK                       equ 0040h
ICDCON0_INBUG_POSN                       equ 0007h
ICDCON0_INBUG_POSITION                   equ 0007h
ICDCON0_INBUG_SIZE                       equ 0001h
ICDCON0_INBUG_LENGTH                     equ 0001h
ICDCON0_INBUG_MASK                       equ 0080h

// Register: ICDSTAT
#define ICDSTAT ICDSTAT
ICDSTAT                                  equ 0F91h
// bitfield definitions
ICDSTAT_USRHLTF_POSN                     equ 0001h
ICDSTAT_USRHLTF_POSITION                 equ 0001h
ICDSTAT_USRHLTF_SIZE                     equ 0001h
ICDSTAT_USRHLTF_LENGTH                   equ 0001h
ICDSTAT_USRHLTF_MASK                     equ 0002h
ICDSTAT_TRP0HLTF_POSN                    equ 0006h
ICDSTAT_TRP0HLTF_POSITION                equ 0006h
ICDSTAT_TRP0HLTF_SIZE                    equ 0001h
ICDSTAT_TRP0HLTF_LENGTH                  equ 0001h
ICDSTAT_TRP0HLTF_MASK                    equ 0040h
ICDSTAT_TRP1HLTF_POSN                    equ 0007h
ICDSTAT_TRP1HLTF_POSITION                equ 0007h
ICDSTAT_TRP1HLTF_SIZE                    equ 0001h
ICDSTAT_TRP1HLTF_LENGTH                  equ 0001h
ICDSTAT_TRP1HLTF_MASK                    equ 0080h

